Расширение_ПечатныеФормыЗиУП/InformationRegisters/КадроваяИсторияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КадроваяИсторияСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКадровыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Расширение_ПечатныеФормыЗиУП/CalculationRegisters/Начисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<CalculationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Начисления</Name>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

Расширение_ПечатныеФормыЗиУП/CalculationRegisters/Удержания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<CalculationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Удержания</Name>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

Расширение_ПечатныеФормыЗиУП/InformationRegisters/СведенияОбОтветственныхЛицах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СведенияОбОтветственныхЛицах</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Расширение_ПечатныеФормыЗиУП/CommonModules/СотрудникиБазовый/Ext/Module.bsl
&После("Печать")
Процедура ЛаРС_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_СправкаВОтделСоцзащиты") Тогда
		ПечатьСправкиВОтделСоцзащиты(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_СправкаВОтделСубсидии") Тогда
		ПечатьСправкиВОтделСубсидии(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
		
	КонецЕсли;	
	
КонецПроцедуры

Функция ПечатнаяФормаСправкиВОтделСоцзащиты(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПФ_MXL_СправкаВОтделСоцзащиты";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.Сотрудники.ПФ_MXL_СправкаВОтделСоцзащиты");
	
	
	МассивОбластейМакета = Новый Массив;
	МассивОбластейМакета.Добавить("Заголовок");
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	ОргКИ.Представление КАК Представление
	|ПОМЕСТИТЬ Адрес
	|ИЗ
	|	Справочник.Организации.КонтактнаяИнформация КАК ОргКИ
	|ГДЕ
	|	ОргКИ.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Организации.НаименованиеПолное КАК СТРОКА(300)) КАК Наименование,
	|	"" Адрес: "" + (ВЫРАЗИТЬ(Адрес.Представление КАК СТРОКА(1000))) КАК Адрес,
	|	"" ИНН "" + (ВЫРАЗИТЬ(Организации.ИНН КАК СТРОКА(10))) КАК ИНН,
	|	&ДатаВыдачи КАК ДатаВыдачи,
	|	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность,
	|	ВЫРАЗИТЬ(КадроваяИсторияСотрудниковСрезПоследних.Период КАК ДАТА) КАК ДатаС,
	|	Организации.НаименованиеСокращенное КАК Организация,
	|	КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
	|ИЗ
	|	Адрес КАК Адрес,
	|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудниковСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО КадроваяИсторияСотрудниковСрезПоследних.Организация = Организации.Ссылка
	|ГДЕ
	|	КадроваяИсторияСотрудниковСрезПоследних.Сотрудник В(&Сотрудник)
	|	И КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Прием)";
	Запрос.УстановитьПараметр("ДатаВыдачи", Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy"));
	Запрос.УстановитьПараметр("Сотрудник", МассивОбъектов);
	ПараметрыМакета = Запрос.Выполнить().Выбрать();
	ПараметрыМакета.Следующий();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Начисления.ПериодРегистрации КАК ПериодРегистрации,
	|	СУММА(Начисления.Результат) КАК Результат,
	|	Начисления.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ Начислено
	|ИЗ
	|	РегистрРасчета.Начисления КАК Начисления
	|ГДЕ
	|	Начисления.ФизическоеЛицо = &ФизическоеЛицо
	|	И Начисления.ПериодРегистрации МЕЖДУ ДОБАВИТЬКДАТЕ(&ТекДата, МЕСЯЦ, -12) И &ТекДата
	|
	|СГРУППИРОВАТЬ ПО
	|	Начисления.ПериодРегистрации,
	|	Начисления.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Удержания.ПериодРегистрации КАК ПериодРегистрации,
	|	СУММА(Удержания.Результат) КАК Результат,
	|	Удержания.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ Удержано
	|ИЗ
	|	РегистрРасчета.Удержания КАК Удержания
	|ГДЕ
	|	Удержания.ФизическоеЛицо = &ФизическоеЛицо
	|	И Удержания.ПериодРегистрации МЕЖДУ ДОБАВИТЬКДАТЕ(&ТекДата, МЕСЯЦ, -12) И &ТекДата
	|
	|СГРУППИРОВАТЬ ПО
	|	Удержания.ПериодРегистрации,
	|	Удержания.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтражениеВБухучетеНачисленныйНДФЛОбороты.Период КАК Период,
	|	ОтражениеВБухучетеНачисленныйНДФЛОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СУММА(ОтражениеВБухучетеНачисленныйНДФЛОбороты.СуммаОборот) КАК СуммаОборот
	|ПОМЕСТИТЬ НДФЛ
	|ИЗ
	|	РегистрНакопления.ОтражениеВБухучетеНачисленныйНДФЛ.Обороты(, , Месяц, ФизическоеЛицо = &ФизическоеЛицо) КАК ОтражениеВБухучетеНачисленныйНДФЛОбороты
	|ГДЕ
	|	ОтражениеВБухучетеНачисленныйНДФЛОбороты.Период МЕЖДУ ДОБАВИТЬКДАТЕ(&ТекДата, МЕСЯЦ, -12) И &ТекДата
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтражениеВБухучетеНачисленныйНДФЛОбороты.Период,
	|	ОтражениеВБухучетеНачисленныйНДФЛОбороты.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Начислено.ПериодРегистрации КАК ДАТА) КАК Период,
	|	Начислено.Результат КАК Начислено,
	|	Удержано.ПериодРегистрации КАК ПериодРегистрации1,
	|	Удержано.Результат КАК Удержано,
	|	НДФЛ.Период КАК ПериодНДФЛ,
	|	НДФЛ.СуммаОборот КАК НДФЛ,
	|	Начислено.ФизическоеЛицо КАК ФизЛицо
	|ИЗ
	|	Начислено КАК Начислено
	|		ЛЕВОЕ СОЕДИНЕНИЕ Удержано КАК Удержано
	|		ПО Начислено.ПериодРегистрации = Удержано.ПериодРегистрации
	|			И Начислено.ФизическоеЛицо = Удержано.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ НДФЛ КАК НДФЛ
	|		ПО Начислено.ПериодРегистрации = НДФЛ.Период
	|			И Начислено.ФизическоеЛицо = НДФЛ.ФизическоеЛицо";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", МассивОбъектов[0].ФизическоеЛицо);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	ТЗ = Результат.Выгрузить();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.Заполнить(ПараметрыМакета);
	ОбластьМакета.Параметры.ДатаС = Формат(ПараметрыМакета.ДатаС,"ДФ=dd.MM.yyyy");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьМакета.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;
	
	ТЗ.Свернуть("ФизЛицо","Начислено,НДФЛ,Удержано");
	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	ОбластьМакета.Параметры.Заполнить(ТЗ[0]);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СведенияОбОтветственныхЛицахСрезПоследних.Руководитель КАК Руководитель,
	|	СведенияОбОтветственныхЛицахСрезПоследних.ГлавныйБухгалтер КАК ГлБух
	|ИЗ
	|	РегистрСведений.СведенияОбОтветственныхЛицах.СрезПоследних(, Организация = &Организация) КАК СведенияОбОтветственныхЛицахСрезПоследних";
	Запрос.УстановитьПараметр("Организация", МассивОбъектов[0].ГоловнаяОрганизация);
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	
	ПолноеИмя = Результат.Руководитель;
	// Сначала разбиваем строку на части (Фамилия, Имя, Отчество)
	ЧастиИмени = ФизическиеЛицаКлиентСервер.ЧастиИмени(ПолноеИмя);
	// Формируем фамилию с инициалами
	ОбластьМакета.Параметры.Руководитель = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧастиИмени);
	
	ПолноеИмя = Результат.ГлБух;
	// Сначала разбиваем строку на части (Фамилия, Имя, Отчество)
	ЧастиИмени = ФизическиеЛицаКлиентСервер.ЧастиИмени(ПолноеИмя);
	// Формируем фамилию с инициалами
	ОбластьМакета.Параметры.ГлБух = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧастиИмени);
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	
	
	Возврат ТабличныйДокумент;
	
КонецФункции


Функция ПечатнаяФормаСправкиВОтделСубсидии(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПФ_MXL_СправкаВОтделСубсидии";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.Сотрудники.ПФ_MXL_СправкаВОтделСубсидии");
	
	
	МассивОбластейМакета = Новый Массив;
	МассивОбластейМакета.Добавить("Заголовок");
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	ОргКИ.Представление КАК Представление
	|ПОМЕСТИТЬ Адрес
	|ИЗ
	|	Справочник.Организации.КонтактнаяИнформация КАК ОргКИ
	|ГДЕ
	|	ОргКИ.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Организации.НаименованиеПолное КАК СТРОКА(300)) КАК Наименование,
	|	"" Адрес: "" + (ВЫРАЗИТЬ(Адрес.Представление КАК СТРОКА(1000))) КАК Адрес,
	|	"" ИНН "" + (ВЫРАЗИТЬ(Организации.ИНН КАК СТРОКА(10))) КАК ИНН,
	|	&ДатаВыдачи КАК ДатаВыдачи,
	|	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность,
	|	ВЫРАЗИТЬ(КадроваяИсторияСотрудниковСрезПоследних.Период КАК ДАТА) КАК ДатаС,
	|	Организации.НаименованиеСокращенное КАК Организация,
	|	КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
	|ИЗ
	|	Адрес КАК Адрес,
	|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудниковСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО КадроваяИсторияСотрудниковСрезПоследних.Организация = Организации.Ссылка
	|ГДЕ
	|	КадроваяИсторияСотрудниковСрезПоследних.Сотрудник В(&Сотрудник)
	|	И КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Прием)";
	Запрос.УстановитьПараметр("ДатаВыдачи", Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy"));
	Запрос.УстановитьПараметр("Сотрудник", МассивОбъектов);
	ПараметрыМакета = Запрос.Выполнить().Выбрать();
	ПараметрыМакета.Следующий();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Начисления.ПериодРегистрации КАК ПериодРегистрации,
	|	СУММА(Начисления.Результат) КАК Результат,
	|	Начисления.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ Начислено
	|ИЗ
	|	РегистрРасчета.Начисления КАК Начисления
	|ГДЕ
	|	Начисления.ФизическоеЛицо = &ФизическоеЛицо
	|	И Начисления.ПериодРегистрации МЕЖДУ ДОБАВИТЬКДАТЕ(&ТекДата, МЕСЯЦ, -12) И &ТекДата
	|
	|СГРУППИРОВАТЬ ПО
	|	Начисления.ПериодРегистрации,
	|	Начисления.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Удержания.ПериодРегистрации КАК ПериодРегистрации,
	|	СУММА(Удержания.Результат) КАК Результат,
	|	Удержания.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ Удержано
	|ИЗ
	|	РегистрРасчета.Удержания КАК Удержания
	|ГДЕ
	|	Удержания.ФизическоеЛицо = &ФизическоеЛицо
	|	И Удержания.ПериодРегистрации МЕЖДУ ДОБАВИТЬКДАТЕ(&ТекДата, МЕСЯЦ, -12) И &ТекДата
	|
	|СГРУППИРОВАТЬ ПО
	|	Удержания.ПериодРегистрации,
	|	Удержания.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтражениеВБухучетеНачисленныйНДФЛОбороты.Период КАК Период,
	|	ОтражениеВБухучетеНачисленныйНДФЛОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СУММА(ОтражениеВБухучетеНачисленныйНДФЛОбороты.СуммаОборот) КАК СуммаОборот
	|ПОМЕСТИТЬ НДФЛ
	|ИЗ
	|	РегистрНакопления.ОтражениеВБухучетеНачисленныйНДФЛ.Обороты(, , Месяц, ФизическоеЛицо = &ФизическоеЛицо) КАК ОтражениеВБухучетеНачисленныйНДФЛОбороты
	|ГДЕ
	|	ОтражениеВБухучетеНачисленныйНДФЛОбороты.Период МЕЖДУ ДОБАВИТЬКДАТЕ(&ТекДата, МЕСЯЦ, -12) И &ТекДата
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтражениеВБухучетеНачисленныйНДФЛОбороты.Период,
	|	ОтражениеВБухучетеНачисленныйНДФЛОбороты.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Начислено.ПериодРегистрации КАК ДАТА) КАК Период,
	|	Начислено.Результат КАК Начислено,
	|	Удержано.ПериодРегистрации КАК ПериодРегистрации1,
	|	Удержано.Результат КАК Удержано,
	|	НДФЛ.Период КАК ПериодНДФЛ,
	|	НДФЛ.СуммаОборот КАК НДФЛ,
	|	Начислено.ФизическоеЛицо КАК ФизЛицо
	|ИЗ
	|	Начислено КАК Начислено
	|		ЛЕВОЕ СОЕДИНЕНИЕ Удержано КАК Удержано
	|		ПО Начислено.ПериодРегистрации = Удержано.ПериодРегистрации
	|			И Начислено.ФизическоеЛицо = Удержано.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ НДФЛ КАК НДФЛ
	|		ПО Начислено.ПериодРегистрации = НДФЛ.Период
	|			И Начислено.ФизическоеЛицо = НДФЛ.ФизическоеЛицо";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", МассивОбъектов[0].ФизическоеЛицо);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	ТЗ = Результат.Выгрузить();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.Заполнить(ПараметрыМакета);
	ОбластьМакета.Параметры.ДатаС = Формат(ПараметрыМакета.ДатаС,"ДФ=dd.MM.yyyy");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьМакета.Параметры.Заполнить(Выборка);
		ОбластьМакета.Параметры.Период = Формат(Выборка.Период,"ДФ=MM.yyyy");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;
	
	ТЗ.Свернуть("ФизЛицо","Начислено,НДФЛ,Удержано");
	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	ОбластьМакета.Параметры.Заполнить(ТЗ[0]);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СведенияОбОтветственныхЛицахСрезПоследних.Руководитель КАК Руководитель,
	|	СведенияОбОтветственныхЛицахСрезПоследних.ГлавныйБухгалтер КАК ГлБух
	|ИЗ
	|	РегистрСведений.СведенияОбОтветственныхЛицах.СрезПоследних(, Организация = &Организация) КАК СведенияОбОтветственныхЛицахСрезПоследних";
	Запрос.УстановитьПараметр("Организация", МассивОбъектов[0].ГоловнаяОрганизация);
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	
	ПолноеИмя = Результат.Руководитель;
	// Сначала разбиваем строку на части (Фамилия, Имя, Отчество)
	ЧастиИмени = ФизическиеЛицаКлиентСервер.ЧастиИмени(ПолноеИмя);
	// Формируем фамилию с инициалами
	ОбластьМакета.Параметры.Руководитель = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧастиИмени);
	
	ПолноеИмя = Результат.ГлБух;
	// Сначала разбиваем строку на части (Фамилия, Имя, Отчество)
	ЧастиИмени = ФизическиеЛицаКлиентСервер.ЧастиИмени(ПолноеИмя);
	// Формируем фамилию с инициалами
	ОбластьМакета.Параметры.ГлБух = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧастиИмени);
	
	ОбластьМакета.Параметры.ДатаВыдачи = Формат(ТекущаяДата(),"ДЛФ=DD");
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	
	
	Возврат ТабличныйДокумент;
	
КонецФункции




Процедура ПечатьСправкиВОтделСоцзащиты(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
	КоллекцияПечатныхФорм,
	"ПФ_MXL_СправкаВОтделСоцзащиты",
	НСтр("ru = 'Справка в отдел соцзащиты'"),
	ПечатнаяФормаСправкиВОтделСоцзащиты(МассивОбъектов, ОбъектыПечати),
	,
	"Справочник.Сотрудники.ПФ_MXL_СправкаВОтделСоцзащиты");
	
КонецПроцедуры 

Процедура ПечатьСправкиВОтделСубсидии(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
	КоллекцияПечатныхФорм,
	"ПФ_MXL_СправкаВОтделСубсидии",
	НСтр("ru = 'Справка в отдел субсидии'"),
	ПечатнаяФормаСправкиВОтделСубсидии(МассивОбъектов, ОбъектыПечати),
	,
	"Справочник.Сотрудники.ПФ_MXL_СправкаВОтделСубсидии");
	
КонецПроцедуры
